app/Controllers/AuthController.php

	public function register()
	{
		if ($this->request->getPost()) {
			$username = $this->request->getVar('username');
			$password = $this->request->getVar('password');
			$email = $this->request->getVar('email');

			$data = $this->request->getPost();
			$validate = $this->validation->run($data, 'reg');
			$errors = $this->validation->getErrors();
			if ($errors) {
				session()->setFlashdata('failed', implode("<br>", $errors));
				return redirect()->back();
			}
			$existingUser = $this->user->where(['username' => $username])->first();
			$existingEmail = $this->user->where(['email' => $email])->first();
---
SELECT *
FROM `user`
WHERE `username` = 'org2'
 LIMIT 1
SELECT *
FROM `user`
WHERE `email` = 'nzpstorage4@gmail.com'
 LIMIT 1

			$this->sendValidationEmail($email, $validationCode);
			$hashPw = md5($password);

			$this->user->insert([
				'username' => $username,
				'password' => $hashPw,
				'email' => $email,
				'role' => 'user',
				'vcode' => $validationCode
			]);
---
INSERT INTO `user` (`username`, `password`, `email`, `role`, `vcode`) VALUES ('org2', '25d55ad283aa400af464c76d713c07ad', 'nzpstorage4@gmail.com', 'user', '756182')