app/Controllers/ProfileController.php

UPDATE `user` SET `password` = 'caf1a3dfb505ffed0d024130f58c5cfa'
WHERE `user`.`id` IN ('2')
---
    public function updatePassword()
    {
        if (!session()->get('isLoggedIn')) {
            return redirect()->to('/login');
        }

        $currentPassword = $this->request->getPost('current_password');
        $newPassword = $this->request->getPost('new_password');
        $confirmPassword = $this->request->getPost('confirm_password');

        $userId = session()->get('user_id');
        $user = $this->account->find($userId);
        $dbPassword = $user['password'];

        if (md5("$currentPassword") !== $dbPassword) {
            session()->setFlashdata('failed', 'Current password is incorrect.');
            return redirect()->to('/account-settings');
        }

        if ($newPassword !== $confirmPassword) {
            session()->setFlashdata('failed', 'New password and confirm password do not match.');
            return redirect()->to('/account-settings');
        }

        $newHashedPassword = md5("$newPassword");
        $this->account->update($userId, ['password' => $newHashedPassword]);