app/Controllers/TransaksiController.php

        public function buy()
        {
            if($this->request->getPost())
            {
                $data = $this->request->getPost();

                $transaksiModel = new \App\Models\TransaksiModel();
                $transaksiDetailModel = new \App\Models\TransaksiDetailModel();

                $dataForm = [
                    'username' => $this->request->getPost('username'),
                    'total_harga' => $this->request->getPost('total_harga'),
                    'alamat' => $this->request->getPost('alamat'),
                    'ongkir' => $this->request->getPost('ongkir'),
                    'status' => 0,
                    'created_by' => $this->request->getPost('username'),
                    'created_date' => date("Y-m-d H:i:s")
                ];

                $transaksiModel->insert($dataForm);
---
INSERT INTO `transaksi` (`username`, `total_harga`, `alamat`, `ongkir`, `status`, `created_by`, `created_date`) VALUES ('zhafif', '71000', 'KAMPUNG NGABEAN ', '9000', 0, 'zhafif', '2023-06-21 03:02:49')

                        'created_date' => date("Y-m-d H:i:s")
                    ];

                    $transaksiDetailModel->insert($dataFormDetail);
---
INSERT INTO `transaksi_detail` (`id_transaksi`, `id_barang`, `jumlah`, `diskon`, `subtotal_harga`, `created_by`, `created_date`) VALUES (1, '0', 1, 0, 22000, 'zhafif', '2023-06-21 03:02:49')